Tekla.Structures.Catalogs.PrinterItemEnumerator
The PrinterItemEnumerator class allows to loop through the catalog printer items.
The following example returns true if an item with the name PDFactoryA3 has been found:
using Tekla.Structures.Catalogs;
public class Example
{
public bool Example1()
{
bool Result = false;
CatalogHandler CatalogHandler = new CatalogHandler();
if (CatalogHandler.GetConnectionStatus())
{
PrinterItemEnumerator PrinterItemEnumerator = CatalogHandler.GetPrinterItems();
while (PrinterItemEnumerator.MoveNext())
{
PrinterItem PrinterItem = PrinterItemEnumerator.Current as PrinterItem;
if (PrinterItem.Name == "PDFactoryA3")
{
Result = true;
break;
}
}
}
return Result;
}
}

Tekla.Structures.Catalogs.PrinterItemEnumerator.#ctor
The constructor takes as parameter the filter for which items from the catalog
will enumerate.

Tekla.Structures.Catalogs.PrinterItemEnumerator.System#Collections#IEnumerator#Current
Implementation for the Curret property required by IEnumerator. The returned object
is always of type PrinterItem.

Tekla.Structures.Catalogs.PrinterItemEnumerator.Current
Returns a printer item instance of the current element.

Tekla.Structures.Catalogs.PrinterItemEnumerator.MoveNext
Moves to the next item in the enumerator.
Returns: False on failure.

Tekla.Structures.Catalogs.PrinterItemEnumerator.Reset
Resets the enumerator to the beginning.

Tekla.Structures.Catalogs.PrinterItemEnumerator.GetSize
Returns the total amout of items.
Returns: The total amount of items.